simulations/naca0012/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    patch;
        nFaces          6084;
        startFace       4431;
    }
    upperAndLower
    {
        type            symmetry;
        physicalType    patch;
        nFaces          40;
        startFace       10515;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       10555;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          10;
        startFace       10565;
    }
    airfoil
    {
        type            wall;
        physicalType    patch;
        nFaces          204;
        startFace       10575;
    }
)

// ************************************************************************* //
